Revit 2027 API
Wood.WoodThickness Property
 The property labeled "Grain Thickness" from the "Wood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodThickness { get; }
Public Shared ReadOnly Property WoodThickness As String
	Get
public:
static property String^ WoodThickness {
	String^ get ();
}
static member WoodThickness : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 100".
See Also
Reference
Wood Class
Autodesk.Revit.DB.Visual Namespace